Revit 2026 API

# DocumentLoadFamily(String, Family) Method

---

Loads an entire family and all its types/symbols into the document and provides a reference to the loaded family.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool LoadFamily(
	string filename,
	out Family family
)
```
```vb
Public Function LoadFamily (
	filename As String,
	<OutAttribute> ByRef family As Family
) As Boolean
```
```cpp
public:
bool LoadFamily(
	String^ filename,
	[OutAttribute] Family^% family
)
```
```fsharp
member LoadFamily :
        filename : string *
        family : Family byref -> bool
```

#### Parameters

filename String
    The fully qualified filename of the Family file, usually ending in .rfa.
family Family
    A reference to the family that was loaded if successful, otherwise .

#### Return Value

BooleanTrue if the entire family was loaded successfully into the project, otherwise False.

| Exception | Condition |
| --- | --- |
| ArgumentException | Thrown when filename is  or empty. |

Loading an entire family may take a considerable amount of time and memory. It is recommended that you use one of the LoadFamilySymbol() methods and only load those symbols that you need.

#### Reference

Document Class

LoadFamily Overload

Autodesk.Revit.DB Namespace